


{
  "pages": [
    {
      
      
      
      "content": "\n",
      "url": "/404.html"
    },{
      "image": "/assets/img/blog/hydejack-9.jpg",
      "title": "About",
      "description": "Resume\n",
      "content": "Software Engineer－軟體工程師\n\n\n\n\n\nWork Portfolio\n\n近年主要專注在“互動軟體研發”，參與過 Whiteboard 電子白板、NovoDS Cloud 雲端數位看板系統、GPIO 感測器控制、遠端會議系統、軟體 CI &amp; 許可證管理後台。上一份工作專案包含「Ai+數據引擎，跨國電商，GA廣告追蹤系統、CRM系統、人才庫系統、NIKE.vn &amp; Golf」等平台前端開發。\n\n【設計思考的啟發】\n\n最早接觸到UIUX領域是任職數位設計公司期間，所屬團隊是由一位義大利籍女藝術總監負責，在她的西式帶領下給了我相當大的影響，總監對專案非常細心負責，也鼓勵我們要有國際視野，並多體驗生活美感提高設計經驗。更了解幾項重要設計原則如：UCD使用者為中心出發、好的設計是使產品易於理解、Design Guideline設計一致性等，透過在不同文化及扎實的實務經驗中，啟發了我對設計思考的看法，了解設計不僅是外觀和感覺，設計就是它的工作方式。\n\n【從前端工程到軟體開發】\n\n近五年的工作經驗與電子科技領域相關，開發過線上雲端軟體、多樣性的前後台網站至B2B的中小企業AI+智能數據服務系統。回顧過去曾任職威剛集團專案的技術經理負責主導平台開發，從無到有並透過研究訪談利害關係人、網站用戶及專業醫療人員，協同工程部、藥師和業務團隊進行功能規劃，如：在線諮詢和醫生預約系統、查藥APP、社群互動功能以及電子商務系統。累積了豐富的專案開發經驗，同時也積極學習其他網頁技術，SEM、Website Meta及Google Optimize、GA、GTM等分析操作，配合集團產品電子商務操作行銷活動，解決網站導入使用介面等問題。這些寶貴的經驗讓我開始負責管理層面的工作，對我而言，積極、主動、負責一直是自己面對工作的態度，保持彈性勇於嘗試付出，才能扮演好自己的角色為團隊加分！\n\n\n\n[Inspiration from design thinking]\n\nThe first time I came into contact with the UIUX field was when I was working in a digital design company. The team I belonged to was headed by an Italian female art director. Her Western-style leadership had a great impact on me. The director was very enthusiastic about the project. Being careful and responsible also encourages us to have an international perspective, experience more of the beauty of life and improve our design experience. I learned more about several important design principles such as: UCD user-centered approach, good design is to make the product easy to understand, Design Guideline design consistency, etc. Through different cultures and solid practical experience, it inspired me to think about design. perspective, understanding that design is not just about how it looks and feels, design is how it works.\n\n[From front-end engineering to software development]\n\nThe past five years of work experience are related to the field of electronic technology. I have developed online cloud software, diverse front-end and back-end websites, and B2B small and medium-sized enterprise AI+ intelligent data service systems. Looking back on the past, I worked as a technical manager for ADATA Group projects and was responsible for leading the development of the platform from scratch. Through research and interviews with stakeholders, website users and professional medical personnel, I collaborated with the engineering department, pharmacists and business teams to carry out functional planning, such as: Online consultation and doctor appointment system, drug search APP, social interaction function and e-commerce system.\n\nHe has accumulated rich experience in project development, and is also actively learning other web page technologies, SEM, Website Meta and Google Optimize, GA, GTM and other analysis operations, cooperating with the group’s product e-commerce operations and marketing activities, and solving problems such as website import and user interface. These valuable experiences allowed me to take charge of management-level work. For me, being positive, proactive, and responsible has always been my attitude towards work. Only by remaining flexible and having the courage to try and give can I play my role well and add points to the team!\n\n",
      "url": "/about/"
    },{
      
      "title": "Blog",
      "description": "The official Hydejack blog. Version updates, example content and how-to guides on how to blog with Jekyll.\n",
      "content": "\n",
      "url": "/"
    },{
      
      "title": "Blog Catalog",
      
      "content": "\n",
      "url": "/blog/"
    },{
      
      "title": "Posts",
      "description": "This is the list layout for showing blog posts, which shows just the title and groups them by year of publication. Check out the blog layout for comparison.\n",
      "content": "\n",
      "url": "/posts/"
    },{
      
      "title": "Projects",
      "description": "\n",
      "content": "\n",
      "url": "/projects/"
    },{
      "image": "/assets/img/blog/hydejack-9.jpg",
      "title": "Resume",
      "description": "Resume\n",
      "content": "Skills\n\n\n  參與 UI/UX 介面設計與 PM 以及後端工程師討論資訊架構以及專案時程\n  擅長跨平台軟體開發 Electron、Vue、React、Nodejs、JS、JQ、TypeScript、Vite 進行產品開發。\n  使用基於 Vue.js 的框架的 SSR 技術 Nuxt.js 或 React Next.js 技術。\n  Cypress、Nghtwatch E2E 測試及 SVN、Git 或 Sourcetree 等版本控管工具。\n  使用瀏覽器開發者工具評估程式運行效能，減少重新渲染，降低資料處理複雜度。\n  與測試工程師合作，進行 bug 修正或是與 PM 討論規格變更。\n\n\nTOOLS SUMMARY\n\n[Develop Language] Html5, CSS3, JS, JQ, Sass, Scss, Stylus, Tailwind CSS\n[Develop Framework] Vue.js, React.js, Nuxt.js, Next.js, Node.js, Fabric.js, WebSocket\n[UI Framework] Quasar, Vuetify, MUI, Ant Design, Element UI\n[UI Design] Figma, Adobe XD, Invision, Sketch, Zeplin\n[UX] Persona, User Story Mapping, Functional Map\n[Visual Processing] Illustrator, PhotoShop, InDesign, Lightroom, AE, Premiere, DaVinci\n[3D Motion] Poser, MAYA, SketchUp\n\nExperience\n\nDelta Electronics\nAug 2022 - Now\nSenior Software Engineer\n\neForce Taiwan Technology\nJul 2020 - Jul 2022\nSenior Frontend Developer\n\nADATA Group _ We-Lead Bio Technology\nJan 2015 - Apr 2020\nTeam Manager\n\nTowan Digital Imaging\nOct 2009 - Apr 2013\nWeb Design Engineer\n\nXigu Culture Communication\nNov 2005 - Jun 2008\nProject Assistant\n\nEducation\n\nNTUST, Taipei\nSep 2004 - Jun 2008\nDepartment of Commercial Design\n\nFu-Hsin Trade &amp; Arts School\nSep 2001 - Jun 2004\nArt Department\n\nAwards\n\n\n  The 5th Nominated for the Czech AniFest International Animation Film Festival\n  The 12th National Technical College Computer Animation Competition\n  2008-YODEX New Generation Design Exhibition\n  The 8th Business Design Graduation Exhibition of Taiwan University of Science and Technology\n  Taiwan University of Science and Technology Campus Design Competition\n\n\nPublishing\n\n\n  “行走的博物馆指南” - 浙江人民美術出版社\nNov 2020 / Book / Language: Simplified Chinese\n  “瘋玩世界級博物館｜The World’s Top Museum” - Uni-Booking Publishing\nMay 2018 / Book &amp; Ebook / Language: Traditional Chinese\n  “巴黎夢幻自助婚紗｜Wedding photography in Paris” - Farreaching Huacheng Publishing\nOct 2014 / Language: Traditional Chinese\n\n\nCertification\n\n\n  Google Analytics (分析) 個人認證資格\n  Google Ads 搜尋廣告認證\n  JavaScript Algorithms and Data Structures\n\n\n\n\n",
      "url": "/resume/"
    },{
      
      
      
      "content": "\n",
      "url": "/CHANGELOG/"
    },{
      
      "title": "Blog",
      "description": "The official Hydejack blog. Version updates, example content and how-to guides on how to blog with Jekyll.\n",
      "content": "\n",
      "url": "/2/"
    },{
      
      "title": "Blog",
      "description": "The official Hydejack blog. Version updates, example content and how-to guides on how to blog with Jekyll.\n",
      "content": "\n",
      "url": "/3/"
    }
  ], 
  "documents": [
    
  ]
}

